reports/333-go.txt
Running 1m test @ http://localhost:8080
  3 threads and 333 connections
  Thread calibration: mean lat.: 1.446ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.445ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.436ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.39ms    2.96ms  73.09ms   99.45%
    Req/Sec     3.53k   581.66    23.22k    95.54%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.18ms
 75.000%    1.63ms
 90.000%    1.97ms
 99.000%    2.50ms
 99.900%   56.29ms
 99.990%   69.31ms
 99.999%   71.61ms
100.000%   73.15ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.096     0.000000            2         1.00
       0.500     0.100000        49618         1.11
       0.676     0.200000        99178         1.25
       0.843     0.300000       148323         1.43
       1.009     0.400000       198000         1.67
       1.181     0.500000       247475         2.00
       1.268     0.550000       272004         2.22
       1.356     0.600000       296652         2.50
       1.446     0.650000       321590         2.86
       1.537     0.700000       346246         3.33
       1.631     0.750000       370937         4.00
       1.679     0.775000       383240         4.44
       1.730     0.800000       395712         5.00
       1.782     0.825000       408026         5.71
       1.837     0.850000       420460         6.67
       1.897     0.875000       432721         8.00
       1.929     0.887500       438801         8.89
       1.965     0.900000       444971        10.00
       2.004     0.912500       451182        11.43
       2.047     0.925000       457344        13.33
       2.095     0.937500       463568        16.00
       2.121     0.943750       466596        17.78
       2.151     0.950000       469723        20.00
       2.183     0.956250       472780        22.86
       2.219     0.962500       475868        26.67
       2.259     0.968750       479018        32.00
       2.281     0.971875       480588        35.56
       2.305     0.975000       482144        40.00
       2.329     0.978125       483617        45.71
       2.357     0.981250       485151        53.33
       2.393     0.984375       486731        64.00
       2.415     0.985938       487496        71.11
       2.441     0.987500       488263        80.00
       2.475     0.989062       489012        91.43
       2.521     0.990625       489775       106.67
       2.595     0.992188       490554       128.00
       2.661     0.992969       490931       142.22
       2.797     0.993750       491317       160.00
       4.843     0.994531       491703       182.86
      12.207     0.995313       492089       213.33
      21.551     0.996094       492476       256.00
      26.479     0.996484       492668       284.44
      31.391     0.996875       492861       320.00
      36.127     0.997266       493056       365.71
      39.615     0.997656       493249       426.67
      43.167     0.998047       493442       512.00
      45.599     0.998242       493538       568.89
      48.863     0.998437       493635       640.00
      51.167     0.998633       493732       731.43
      53.983     0.998828       493828       853.33
      56.671     0.999023       493924      1024.00
      58.047     0.999121       493972      1137.78
      59.295     0.999219       494021      1280.00
      60.991     0.999316       494069      1462.86
      62.431     0.999414       494117      1706.67
      63.839     0.999512       494166      2048.00
      64.703     0.999561       494190      2275.56
      65.279     0.999609       494216      2560.00
      65.855     0.999658       494238      2925.71
      66.623     0.999707       494263      3413.33
      67.327     0.999756       494287      4096.00
      67.711     0.999780       494299      4551.11
      68.031     0.999805       494311      5120.00
      68.287     0.999829       494322      5851.43
      68.543     0.999854       494335      6826.67
      68.927     0.999878       494348      8192.00
      69.055     0.999890       494352      9102.22
      69.311     0.999902       494360     10240.00
      69.439     0.999915       494365     11702.86
      69.631     0.999927       494373     13653.33
      69.759     0.999939       494376     16384.00
      69.951     0.999945       494381     18204.44
      70.015     0.999951       494383     20480.00
      70.079     0.999957       494385     23405.71
      70.207     0.999963       494390     27306.67
      70.399     0.999969       494391     32768.00
      70.655     0.999973       494393     36408.89
      70.783     0.999976       494395     40960.00
      70.911     0.999979       494396     46811.43
      71.295     0.999982       494397     54613.33
      71.615     0.999985       494401     65536.00
      71.615     0.999986       494401     72817.78
      71.615     0.999988       494401     81920.00
      71.615     0.999989       494401     93622.86
      71.679     0.999991       494402    109226.67
      71.935     0.999992       494403    131072.00
      71.935     0.999993       494403    145635.56
      71.935     0.999994       494403    163840.00
      72.319     0.999995       494404    187245.71
      72.319     0.999995       494404    218453.33
      72.575     0.999996       494405    262144.00
      72.575     0.999997       494405    291271.11
      72.575     0.999997       494405    327680.00
      72.575     0.999997       494405    374491.43
      72.575     0.999998       494405    436906.67
      73.151     0.999998       494406    524288.00
      73.151     1.000000       494406          inf
#[Mean    =        1.394, StdDeviation   =        2.956]
#[Max     =       73.088, Total count    =       494406]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  597346 requests in 1.00m, 67.22MB read
Requests/sec:   9955.57
Transfer/sec:      1.12MB