reports/333-go.txt
Running 1m test @ http://localhost:8080
  3 threads and 333 connections
  Thread calibration: mean lat.: 1.931ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.992ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 3.866ms, rate sampling interval: 13ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.22ms    4.87ms 108.99ms   99.28%
    Req/Sec     3.54k     3.03k   30.78k    50.10%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.77ms
 75.000%    2.41ms
 90.000%    3.17ms
 99.000%    5.85ms
 99.900%   85.38ms
 99.990%  104.32ms
 99.999%  108.74ms
100.000%  109.06ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.093     0.000000            1         1.00
       0.754     0.100000        49551         1.11
       1.077     0.200000        99016         1.25
       1.337     0.300000       148420         1.43
       1.562     0.400000       198012         1.67
       1.770     0.500000       247437         2.00
       1.876     0.550000       272029         2.22
       1.989     0.600000       296713         2.50
       2.111     0.650000       321717         2.86
       2.249     0.700000       346252         3.33
       2.413     0.750000       370986         4.00
       2.507     0.775000       383453         4.44
       2.611     0.800000       395787         5.00
       2.723     0.825000       408048         5.71
       2.853     0.850000       420479         6.67
       2.999     0.875000       432759         8.00
       3.081     0.887500       438853         8.89
       3.173     0.900000       445072        10.00
       3.277     0.912500       451211        11.43
       3.401     0.925000       457416        13.33
       3.547     0.937500       463605        16.00
       3.637     0.943750       466696        17.78
       3.745     0.950000       469799        20.00
       3.865     0.956250       472846        22.86
       4.017     0.962500       475968        26.67
       4.203     0.968750       479087        32.00
       4.311     0.971875       480584        35.56
       4.439     0.975000       482111        40.00
       4.591     0.978125       483667        45.71
       4.771     0.981250       485224        53.33
       5.027     0.984375       486756        64.00
       5.215     0.985938       487519        71.11
       5.447     0.987500       488297        80.00
       5.687     0.989062       489067        91.43
       5.983     0.990625       489841       106.67
       6.611     0.992188       490609       128.00
       7.439     0.992969       490994       142.22
      11.959     0.993750       491380       160.00
      15.831     0.994531       491767       182.86
      39.231     0.995313       492156       213.33
      43.071     0.996094       492540       256.00
      44.991     0.996484       492735       284.44
      49.535     0.996875       492926       320.00
      67.647     0.997266       493121       365.71
      70.143     0.997656       493316       426.67
      71.999     0.998047       493509       512.00
      72.767     0.998242       493605       568.89
      73.791     0.998437       493699       640.00
      74.943     0.998633       493794       731.43
      77.951     0.998828       493892       853.33
      86.719     0.999023       493988      1024.00
      91.711     0.999121       494036      1137.78
      96.639     0.999219       494084      1280.00
      98.175     0.999316       494132      1462.86
      99.135     0.999414       494183      1706.67
      99.967     0.999512       494229      2048.00
     100.607     0.999561       494257      2275.56
     101.055     0.999609       494280      2560.00
     101.311     0.999658       494302      2925.71
     101.567     0.999707       494327      3413.33
     101.887     0.999756       494350      4096.00
     102.143     0.999780       494362      4551.11
     102.463     0.999805       494375      5120.00
     102.783     0.999829       494387      5851.43
     103.231     0.999854       494398      6826.67
     103.807     0.999878       494410      8192.00
     104.127     0.999890       494416      9102.22
     104.319     0.999902       494423     10240.00
     104.575     0.999915       494429     11702.86
     104.831     0.999927       494434     13653.33
     105.407     0.999939       494440     16384.00
     105.599     0.999945       494443     18204.44
     106.175     0.999951       494446     20480.00
     106.303     0.999957       494449     23405.71
     106.559     0.999963       494453     27306.67
     106.943     0.999969       494455     32768.00
     107.519     0.999973       494458     36408.89
     107.519     0.999976       494458     40960.00
     107.967     0.999979       494460     46811.43
     108.223     0.999982       494461     54613.33
     108.415     0.999985       494463     65536.00
     108.543     0.999986       494464     72817.78
     108.543     0.999988       494464     81920.00
     108.735     0.999989       494465     93622.86
     108.799     0.999991       494467    109226.67
     108.799     0.999992       494467    131072.00
     108.799     0.999993       494467    145635.56
     108.799     0.999994       494467    163840.00
     108.863     0.999995       494468    187245.71
     108.863     0.999995       494468    218453.33
     108.927     0.999996       494469    262144.00
     108.927     0.999997       494469    291271.11
     108.927     0.999997       494469    327680.00
     108.927     0.999997       494469    374491.43
     108.927     0.999998       494469    436906.67
     109.055     0.999998       494470    524288.00
     109.055     1.000000       494470          inf
#[Mean    =        2.225, StdDeviation   =        4.869]
#[Max     =      108.992, Total count    =       494470]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  592499 requests in 1.00m, 66.68MB read
  Socket errors: connect 0, read 43, write 0, timeout 0
Requests/sec:   9872.33
Transfer/sec:      1.11MB